# FabricationHostedInfo Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FabricationHostedInfo Properties
FabricationHostedInfo Class See Also
---
The FabricationHostedInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostId | Returns the Id of the host. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace